openfoam/run/Airfold2D_full/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\ 																
| =========                 |                                                 | 																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               | 																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 | 																
\*---------------------------------------------------------------------------*/ 																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
convertToMeters	1	;														
																
geometry																
{																
}																
																
vertices																
(																
	(	0	0	0	)	//	0									
	(	1	0	0	)	//	1									
	(	1	12	0	)	//	2									
	(	-11	0	0	)	//	3									
	(	0	0	0.3	)	//	4									
	(	1	0	0.3	)	//	5									
	(	1	12	0.3	)	//	6									
	(	-11	0	0.3	)	//	7									
	(	21	11.1283045488973	0	)	//	8									
	(	21	12	0	)	//	9									
	(	21	11.1283045488973	0.3	)	//	10									
	(	21	12	0.3	)	//	11									
	(	1	-12	0	)	//	12									
	(	1	-12	0.3	)	//	13									
	(	21	-12	0	)	//	14									
	(	21	-12	0.3	)	//	15									
	(	1	0	0	)	//	16									
	(	1	0	0.3	)	//	17									
																
);																
																
																
blocks																
(																
	hex	(0	1	2	3	4	5	6	7)	(	41	48	1	)	//block	1
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03	0.03														
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	//	y-direction	expansion	ratio												
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(1	8	9	2	5	10	11	6)	(	74	48	1)	//block	2	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
	13.9581659180375	13.9581659180375														
	(															
(	0.041666666666667	0.354166666666667	22.1861110674044	)												
(	0.958333333333333	0.645833333333333	9.0146488220659	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(3	12	16	0	7	13	17	4)	(	41	48	1	)	//block	3
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	0.03															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	(															
(	0.4	0.51219512195122	3.5	)												
(	0.6	0.487804878048781	0.857142857142857	)												
	)															
	0.03															
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
																
																
																
																
	hex	(12	14	8	16	13	15	10	17)	(	74	48	1)	//block	4	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	33.3333333333333	33.3333333333333	33.3333333333333	33.3333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
	0.071642650321827	0.071642650321827														
	(															
(	0.958333333333333	0.645833333333333	0.110930555337022	)												
(	0.041666666666667	0.354166666666667	0.04507324411033	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
);																
																
																
edges																
(																
	arc	3 2	(	-7.48528137423857	8.48528137423857	0	)									
	arc	7 6 	(	-7.48528137423857	8.48528137423857	0.3	)									
																
	spline	1	0													
	(															
	(	0.999022881821262	0.000208720892357	0	)											
	(	0.996095124172846	0.000832330261578	0	)											
	(	0.991227512591776	0.001863227546946	0	)											
	(	0.984438005370507	0.003288939962656	0	)											
	(	0.975751705401026	0.005092404207668	0	)											
	(	0.965200817425843	0.007252340538068	0	)											
	(	0.952824587751651	0.009743700478564	0	)											
	(	0.938669223148849	0.012538166265822	0	)											
	(	0.922787785637432	0.015604678358884	0	)											
	(	0.905240060145343	0.018909967133752	0	)											
	(	0.886092392587096	0.022419066211124	0	)											
	(	0.865417496688818	0.026095787655127	0	)											
	(	0.843294228800416	0.029903143335474	0	)											
	(	0.819807330893189	0.033803701787269	0	)											
	(	0.79504714284606	0.037759875583902	0	)											
	(	0.76910928588698	0.041734140164188	0	)											
	(	0.742094319606093	0.045689190808366	0	)											
	(	0.714107375246584	0.049588049628686	0	)											
	(	0.685257767990137	0.053394138652209	0	)											
	(	0.655658590701268	0.057071338009544	0	)											
	(	0.625426291123582	0.060584049668915	0	)											
	(	0.594680233903201	0.063897286935278	0	)											
	(	0.563542248140862	0.066976808045124	0	)											
	(	0.532136160544701	0.069789308719446	0	)											
	(	0.500587313769411	0.072302683691441	0	)											
	(	0.46902206927069	0.074486361302583	0	)											
	(	0.437567294040999	0.076311708643109	0	)											
	(	0.406349830957633	0.077752497840245	0	)											
	(	0.375297079422019	0.078743385194258	0	)											
	(	0.344679990725195	0.079179838403717	0	)											
	(	0.314678173397968	0.079050841225806	0	)											
	(	0.28541848815115	0.078354599273355	0	)											
	(	0.257024916624199	0.077095973101721	0	)											
	(	0.22961781519074	0.075286603370525	0	)											
	(	0.203313178760311	0.072944880680298	0	)											
	(	0.178221930492176	0.07009573999983	0	)											
	(	0.154449253520937	0.066770266474859	0	)											
	(	0.13209397988424	0.06300510756905	0	)											
	(	0.111248049857913	0.058841695489676	0	)											
	(	0.091996051958156	0.054325293192623	0	)											
	(	0.074414850166527	0.049503886419278	0	)											
	(	0.058573300745446	0.044426952673779	0	)											
	(	0.044532056660924	0.039144145323045	0	)											
	(	0.032343453456462	0.033703936678309	0	)											
	(	0.02205146675846	0.028152267666707	0	)											
	(	0.013691728731746	0.022531253298792	0	)											
	(	0.007291588972595	0.016877992469892	0	)											
	(	0.002870204671333	0.011223527704449	0	)											
	(	0.000438645446827	0.005591995382178	0	)											
	)															
																
																
	spline	5	4													
	(															
	(	0.999022881821262	0.000208720892357	0.3	)											
	(	0.996095124172846	0.000832330261578	0.3	)											
	(	0.991227512591776	0.001863227546946	0.3	)											
	(	0.984438005370507	0.003288939962656	0.3	)											
	(	0.975751705401026	0.005092404207668	0.3	)											
	(	0.965200817425843	0.007252340538068	0.3	)											
	(	0.952824587751651	0.009743700478564	0.3	)											
	(	0.938669223148849	0.012538166265822	0.3	)											
	(	0.922787785637432	0.015604678358884	0.3	)											
	(	0.905240060145343	0.018909967133752	0.3	)											
	(	0.886092392587096	0.022419066211124	0.3	)											
	(	0.865417496688818	0.026095787655127	0.3	)											
	(	0.843294228800416	0.029903143335474	0.3	)											
	(	0.819807330893189	0.033803701787269	0.3	)											
	(	0.79504714284606	0.037759875583902	0.3	)											
	(	0.76910928588698	0.041734140164188	0.3	)											
	(	0.742094319606093	0.045689190808366	0.3	)											
	(	0.714107375246584	0.049588049628686	0.3	)											
	(	0.685257767990137	0.053394138652209	0.3	)											
	(	0.655658590701268	0.057071338009544	0.3	)											
	(	0.625426291123582	0.060584049668915	0.3	)											
	(	0.594680233903201	0.063897286935278	0.3	)											
	(	0.563542248140862	0.066976808045124	0.3	)											
	(	0.532136160544701	0.069789308719446	0.3	)											
	(	0.500587313769411	0.072302683691441	0.3	)											
	(	0.46902206927069	0.074486361302583	0.3	)											
	(	0.437567294040999	0.076311708643109	0.3	)											
	(	0.406349830957633	0.077752497840245	0.3	)											
	(	0.375297079422019	0.078743385194258	0.3	)											
	(	0.344679990725195	0.079179838403717	0.3	)											
	(	0.314678173397968	0.079050841225806	0.3	)											
	(	0.28541848815115	0.078354599273355	0.3	)											
	(	0.257024916624199	0.077095973101721	0.3	)											
	(	0.22961781519074	0.075286603370525	0.3	)											
	(	0.203313178760311	0.072944880680298	0.3	)											
	(	0.178221930492176	0.07009573999983	0.3	)											
	(	0.154449253520937	0.066770266474859	0.3	)											
	(	0.13209397988424	0.06300510756905	0.3	)											
	(	0.111248049857913	0.058841695489676	0.3	)											
	(	0.091996051958156	0.054325293192623	0.3	)											
	(	0.074414850166527	0.049503886419278	0.3	)											
	(	0.058573300745446	0.044426952673779	0.3	)											
	(	0.044532056660924	0.039144145323045	0.3	)											
	(	0.032343453456462	0.033703936678309	0.3	)											
	(	0.02205146675846	0.028152267666707	0.3	)											
	(	0.013691728731746	0.022531253298792	0.3	)											
	(	0.007291588972595	0.016877992469892	0.3	)											
	(	0.002870204671333	0.011223527704449	0.3	)											
	(	0.000438645446827	0.005591995382178	0.3	)											
	)															
																
																
	arc	3 12	(	-7.48528137423857	-8.48528137423857	0	)									
	arc	7 13	(	-7.48528137423857	-8.48528137423857	0.3	)									
																
	spline	0	16													
	(															
	(	0.001534626124902	-0.005394911587549	0	)											
	(	0.005015094014189	-0.010438883956857	0	)											
	(	0.010421160298717	-0.015126326385683	0	)											
	(	0.017725110139623	-0.019451258021947	0	)											
	(	0.026892016946387	-0.023407635833545	0	)											
	(	0.037880060655286	-0.026989794138022	0	)											
	(	0.050640890873056	-0.030192968691042	0	)											
	(	0.065120019210691	-0.033013873015776	0	)											
	(	0.081257224331458	-0.035451291143136	0	)											
	(	0.098986953666896	-0.037506649407467	0	)											
	(	0.118238707366297	-0.039184530501085	0	)											
	(	0.138937392694348	-0.040493095618806	0	)											
	(	0.161003640550374	-0.041444385091351	0	)											
	(	0.184354079759134	-0.042054474175309	0	)											
	(	0.208901568947215	-0.042343468298769	0	)											
	(	0.234555389830263	-0.042335330634642	0	)											
	(	0.261221409274085	-0.042057543906085	0	)											
	(	0.288802220283777	-0.041540617304581	0	)											
	(	0.317197273917354	-0.04081745780177	0	)											
	(	0.346303014899857	-0.039922632470127	0	)											
	(	0.376013033413126	-0.038891554263766	0	)											
	(	0.406268854456642	-0.037756920929734	0	)											
	(	0.437099472394696	-0.036466573254497	0	)											
	(	0.468187411199996	-0.035009318011779	0	)											
	(	0.499412686230589	-0.033413794802552	0	)											
	(	0.530654358984613	-0.031707610307071	0	)											
	(	0.561790985423442	-0.029916855624607	0	)											
	(	0.592701080682524	-0.028065739237782	0	)											
	(	0.623263596041273	-0.026176344525693	0	)											
	(	0.65335840367368	-0.024268513025169	0	)											
	(	0.682866784694542	-0.022359847190075	0	)											
	(	0.711671916318489	-0.020465819677344	0	)											
	(	0.739659354495622	-0.018599970590343	0	)											
	(	0.766717509092018	-0.016774169947773	0	)											
	(	0.792738109446413	-0.014998920131944	0	)											
	(	0.817616658855501	-0.013283672304119	0	)											
	(	0.841252877128273	-0.011637131741219	0	)											
	(	0.863551130732595	-0.010067529619938	0	)											
	(	0.884420850188694	-0.008582842722323	0	)											
	(	0.903776934229605	-0.007190947548681	0	)											
	(	0.921540139864584	-0.005899701025087	0	)											
	(	0.937637456895015	-0.004716945974351	0	)											
	(	0.952002464714369	-0.003650445363585	0	)											
	(	0.964575668462409	-0.002707754651013	0	)											
	(	0.975304810894128	-0.001896045977266	0	)											
	(	0.984145155758124	-0.001221901198028	0	)											
	(	0.991059738136913	-0.000691092636824	0	)											
	(	0.996019577141632	-0.000308370847414	0	)											
	(	0.99900384660701	-7.72776153725949E-05	0	)											
	)															
																
																
	spline	4	17													
	(															
	(	0.001534626124902	-0.005394911587549	0.3	)											
	(	0.005015094014189	-0.010438883956857	0.3	)											
	(	0.010421160298717	-0.015126326385683	0.3	)											
	(	0.017725110139623	-0.019451258021947	0.3	)											
	(	0.026892016946387	-0.023407635833545	0.3	)											
	(	0.037880060655286	-0.026989794138022	0.3	)											
	(	0.050640890873056	-0.030192968691042	0.3	)											
	(	0.065120019210691	-0.033013873015776	0.3	)											
	(	0.081257224331458	-0.035451291143136	0.3	)											
	(	0.098986953666896	-0.037506649407467	0.3	)											
	(	0.118238707366297	-0.039184530501085	0.3	)											
	(	0.138937392694348	-0.040493095618806	0.3	)											
	(	0.161003640550374	-0.041444385091351	0.3	)											
	(	0.184354079759134	-0.042054474175309	0.3	)											
	(	0.208901568947215	-0.042343468298769	0.3	)											
	(	0.234555389830263	-0.042335330634642	0.3	)											
	(	0.261221409274085	-0.042057543906085	0.3	)											
	(	0.288802220283777	-0.041540617304581	0.3	)											
	(	0.317197273917354	-0.04081745780177	0.3	)											
	(	0.346303014899857	-0.039922632470127	0.3	)											
	(	0.376013033413126	-0.038891554263766	0.3	)											
	(	0.406268854456642	-0.037756920929734	0.3	)											
	(	0.437099472394696	-0.036466573254497	0.3	)											
	(	0.468187411199996	-0.035009318011779	0.3	)											
	(	0.499412686230589	-0.033413794802552	0.3	)											
	(	0.530654358984613	-0.031707610307071	0.3	)											
	(	0.561790985423442	-0.029916855624607	0.3	)											
	(	0.592701080682524	-0.028065739237782	0.3	)											
	(	0.623263596041273	-0.026176344525693	0.3	)											
	(	0.65335840367368	-0.024268513025169	0.3	)											
	(	0.682866784694542	-0.022359847190075	0.3	)											
	(	0.711671916318489	-0.020465819677344	0.3	)											
	(	0.739659354495622	-0.018599970590343	0.3	)											
	(	0.766717509092018	-0.016774169947773	0.3	)											
	(	0.792738109446413	-0.014998920131944	0.3	)											
	(	0.817616658855501	-0.013283672304119	0.3	)											
	(	0.841252877128273	-0.011637131741219	0.3	)											
	(	0.863551130732595	-0.010067529619938	0.3	)											
	(	0.884420850188694	-0.008582842722323	0.3	)											
	(	0.903776934229605	-0.007190947548681	0.3	)											
	(	0.921540139864584	-0.005899701025087	0.3	)											
	(	0.937637456895015	-0.004716945974351	0.3	)											
	(	0.952002464714369	-0.003650445363585	0.3	)											
	(	0.964575668462409	-0.002707754651013	0.3	)											
	(	0.975304810894128	-0.001896045977266	0.3	)											
	(	0.984145155758124	-0.001221901198028	0.3	)											
	(	0.991059738136913	-0.000691092636824	0.3	)											
	(	0.996019577141632	-0.000308370847414	0.3	)											
	(	0.99900384660701	-7.72776153725949E-05	0.3	)											
	)															
																
																
);																
																
faces																
(																
																
);																
																
faces																
(																
  																
);																
																
																
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}																
																
boundary																
(																
inlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (9 2 6 11)  // block face in this patch																
                (2 3 7 6  )  // block face in this patch																
                (3 12 13 7  )  // block face in this patch																
                (12 15 14 13  )  // block face in this patch																
            );																
        } 																
																
outlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (8 9 10 11)  // block face in this patch																
                (15 8 10 14  )  // block face in this patch																
            );																
        }																
																
walls              // patch name																
        {																
            type wall;    // patch type for patch 0																
            faces																
            (																
                (0 1 5 4)  // block face in this patch																
                (0 4 17 16  )  // block face in this patch																
            );																
        } 																
																
interface1              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (1 8 10 5)  // block face in this patch																
            );																
        } 																
interface2              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (16 17 10 8)  // block face in this patch																
            );																
        } 																
);																
																
 mergePatchPairs																
(																
    ( interface1 interface2 ) 																
);																
// ************************************************************************* //																

